{
    "data": [
        {
            "image": "portfolio_robertmonden.png",
            "title": "Personal portfolio website",
            "description": [
                "My personal portfolio website is the website you are currently visiting. Due to a positive experience with Angular, I decided to rewrite my existing portfolio website (which left pretty much everything to be desired) using Angular 6.",

                "In March 2020, the website was ported to React."
            ],
            "github": "nedroden/robertmonden.com",
            "skills": ["Typescript", "React", "HTML", "CSS"],
            "dates": ["September 2018", "present"]
        },
        {
            "image": "portfolio_draiwiki.png",
            "title": "DraiWiki - open source wiki software",
            "description": [
                "DraiWiki is a free and open source wiki software written in PHP 7.2. It was designed to be secure, customizable and easy to use. The software makes extensive use of other open source packages.",

                "Authorization is implemented using a permission system, in which all users can be assigned one or more permission profiles, which are determined by the groups the user is a member of.",

                "As customization was a high priority, localization and styling is very easy. The software supports multiple languages and it is very easy to switch between them."
            ],
            "github": "nedroden/DraiWiki",
            "skills": ["PHP (OOP)", "MySQL", "Javascript", "HTML", "CSS", "Git"],
            "dates": ["February 2017", "July 2018"]
        },
        {
            "image": "portfolio_hilang.png",
            "title": "HiLang - language learning infrastructure",
            "description": [
                "In the second half of the second semester a couple of other students and I decided to build a language learning infrastructure (consisting of an API, web interface and a mobile app) as that block's project.",

                "With HiLang, courses can be created by so-called \"distributors\" and can be enrolled to by other users. Courses consist of vocabulary lists and grammar, both of which can be practiced through exercises."
            ],
            "github": "RockingStars/Enjun",
            "skills": ["Python", "Django", "Angular", "REST", "React Native", "App development"],
            "dates": ["May-June 2018"]
        },
        {
            "image": "portfolio_enjun.png",
            "title": "Reversi and Tic Tac Toe with AI",
            "description": [
                "In late March 2018, three other students and I developed, as part of a school project, a simple game framework. Using this game framework, we developed two games, both with an AI: reversi and tic tac toe.",
                "At the end of the project there was a tournament, where groups had their AI play against other groups' AIs. We finished fourth."
            ],
            "github": "RockingStars/Enjun",
            "skills": ["Java", "Java FX", "Git", "Scrum", "Networking (TCP)", "AI"],
            "dates": ["March 2018"]
        }
    ]
}
